# Number Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpacingRule..::..Number Property
SpacingRule Class See Also
---
The exact number of lines in the region.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Number { get; set; }
```

Visual Basic
---
```text
Public Property Number As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Number {
	int get ();
	void set (int value);
}
```

# Remarks
This property is only available when Layout is equal to FixedNumber. Lines will be placed exactly at the boundaries if possible, so if your region is 100' long and you specify Number = 11, your lines will be 10' apart. Must be between 1 and 200.
# See Also
SpacingRule Class
Autodesk.Revit.DB Namespace